# 1149

#  26   57     13 
#  빨    파    빨   
#   1    2     3 

total_money = []

n = int(input())

for i in range(n):
    total_money.append(list(map(int, input().split())))

# for i in range(0, n-1):
#     total_money[i][0] = min(total_money[i+1][1], total_money[i+1][2]) + total_money[i][0]
#     total_money[i][1] = min(total_money[i+1][0], total_money[i+1][2]) + total_money[i][1]
#     total_money[i][2] = min(total_money[i+1][0], total_money[i+1][1]) + total_money[i][2]

for i in range(1, n):
    total_money[i][0] = min(total_money[i - 1][1], total_money[i - 1][2]) + total_money[i][0]
    total_money[i][1] = min(total_money[i - 1][0], total_money[i - 1][2]) + total_money[i][1]
    total_money[i][2] = min(total_money[i - 1][0], total_money[i - 1][1]) + total_money[i][2]
print(min(total_money[n-1][0], total_money[n-1][1], total_money[n-1][2]))



# (N = 3)
# [['26', '40', '83'],  ['49', '60', '57'],    ['13', '89', '99']]
#  빨강    초록   파랑     빨강    초록   파랑     빨강    초록   파랑
# [0][0] [0][1] [0][2] / [1][0] [1][1] [1][2] / [2][0] [2][1] [2][2]
#           A                    B                       C  
#        if [0][0] : 26       [1][1] : 60             [2][0]   : 13
#                                                     [2][2]   : 99                             
#                             [1][2] : 57             [2][0]   : 13
#                                                     [2][1]   : 89
#            

# (N = 3)
# [['26', '40', '83'],  ['49', '60', '57'],      ['13', '89', '99'],    ['25', '76' '35']]
#  빨강    초록   파랑     빨강    초록   파랑     빨강    초록   파랑      빨강   초록  파랑

#           A                    B                       C                  D
#       [0][1] : 26           [1][0] : 49          [2][0] : 13          [3][0] : 25             
#       [0][2] : 40                                                                      
#       [0][0] : 26           [1][1] : 60          [2][1] : 89          [3][1] : 76
#       [0][2] : 83                                
#       [0][0] : 26           [1][2] : 57          [2][2] : 99          [3][2] : 35
#       [0][1] : 40                                




# (N = 4)
# [['26', '40', '83'],   ['49', '60', '57'],    ['13', '89', '99'],    ['25', '76' '35']]
# [0][0] [0][1] [0][2] / [1][0] [1][1] [1][2] / [2][0] [2][1] [2][2] / [3][0] [3][1] [3][2]
#          A                      B                      C                      D
#        if [0][0]            [1][1]                  [2][0]                 [3][1]
#                                                                            [3][2]            
#                                                     [2][2]                 [3][0]
#                                                                            [3][1]
#                             [1][2]                  [2][0]                 [3][1]
#                                                                            [3][2]
#                                                     [2][1]                 [3][0]
#                                                                            [3][2]

#                            [0][0]
#             [1][1]                           [1][2]
#     [2][0]          [2][2]           [2][0]         [2][1]


#                            [0][0]
#             [1][1]                           [1][2]
#     [2][0]          [2][2]           [2][0]         [2][1]
# [3][1]  [3][2]  [3][0]  [3][1]   [3][1]  [3][2]  [3][0]  [3][2]
